---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.TypicalInsulationDarkRoof
enum: Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType
source: html/c650c305-159f-20a2-457a-8d2cbfe2dc1a.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType.TypicalInsulationDarkRoof

Typical Insulation Dark Roof